Repository: RiccardoCominardi/EnvironmentsManagement
Catalog: Translations/Restore Environment.*.xlf
Languages: it_it

# Codeunit 583858742 - Method 951961053 - NamedType 4204058380
source: Cannot execute this funcionality in a non-production environment.
it_it: Non è possibile aprire la pagina in un ambiente Sandbox.

# Codeunit 583858742 - Method 1220538819 - NamedType 4204058380
source: Field %1 must be filled in.
it_it: Il campo %1 deve essere compilato.

# Codeunit 583858742 - Method 838713857 - NamedType 1327832897
source: Deleted %1 Job Queue Entries
it_it: Sono state cancellate %1 movimenti coda processi

# Codeunit 583858742 - Method 838713857 - NamedType 1196336482
source: No Job Queue Entries to delete
it_it: Nessuna coda processi da cancellare

# Codeunit 583858742 - Method 2651863686 - NamedType 1327832897
source: Choose a function to execute
it_it: Scegli una funzione da eseguire

# Codeunit 583858742 - Method 2651863686 - NamedType 1196336482
source: Delete Environment,Get Environment Status,Copy Environment,Cancel
it_it: Cancella ambiente,Ottieni stato ambiente,Copia ambiente,Annulla

# Codeunit 583858742 - Method 2651863686 - NamedType 1753513791
source: Operation Completed. Check the status of the environment in the admincenter or use the function Get Environment Status
it_it: Operazione completata. Controlla lo stato del nuovo ambiente dall'AdminCenter o utilizza la funzione "Ottieni stato ambiente"

# Codeunit 583858742 - Method 2651863686 - NamedType 3779895200
source: Operation Completed. Environment %1 is currently in status %2.
it_it: Operazione completata. L'ambiente %1 attualmente è in stato %2

# Codeunit 583858742 - Method 2356848215 - NamedType 4204058380
source: Job Queue is already present in company %1. Open the setup in that specific company or delete and recreate the job queue entry.
it_it: La coda processi è già presente nella società %1. Apri il setup in quella società o cancella e ricrea la coda

# Codeunit 583858742 - Method 2653096382 - NamedType 1327832897
source: Restore Environment (ENV)
it_it: Ripristina ambiente (ENV)

# Codeunit 1773623840 - Method 1147532894 - NamedType 1327832897
source: Invalid File
it_it: File non valido

# Codeunit 1773623840 - Method 1147532894 - NamedType 1196336482
source: Import Completed
it_it: Import completato

# Codeunit 1773623840 - Method 13764402 - NamedType 1196336482
source: Import Completed
it_it: Import completato

# Codeunit 1773623840 - Method 13764402 - NamedType 1327832897
source: Invalid File
it_it: File non valido

# Codeunit 1773623840 - Method 535775630 - NamedType 1327832897
source: Import Records: #1########
it_it: Importazioni records: #1########

# Codeunit 583858742 - Method 3120216751 - NamedType 4204058380
source: Environment cannot be restored beacuse is already present in Active status. Please delete first and try again later.
it_it: L'ambiente non può essere ripristinato perchè è in stato Active. Cancella prima l'ambiente e riprova

# Codeunit 583858742 - Method 3120216751 - NamedType 2316870939
source: Maximum number of attempts reached. Please try again later.
it_it: Raggiunto il numero massimo di tentativi. Rirpova più tardi

# Codeunit 583858742 - Method 3120216751 - NamedType 1753513791
source: Operation Completed. Check the status of the environment in the admincenter or use the function Get Environment Status
it_it: Operazione completata. Controlla lo stato del nuovo ambiente dall'AdminCenter o utilizza la funzione "Ottieni stato ambiente"

# Page 471369648 - Property 2879900210
source: Restore Environment (ENV)
it_it: Ripristina ambiente (ENV)

# Table 471369648 - Property 2879900210
source: Restore Environment (ENV)
it_it: Ripristina ambiente (ENV)

# PermissionSet 572033766 - Property 2879900210
source: Restore Environment (ENV)
it_it: Ripristina ambiente (ENV)

# Enum 3439065488 - EnumValue 1064651029 - Property 2879900210
source: Fixed Time
it_it: Tempo fisso

# Enum 3439065488 - EnumValue 3500269956 - Property 2879900210
source: After Deletion
it_it: Dopo cancellazione

# Enum 4104196774 - EnumValue 3817527484 - Property 2879900210
source: Modify
it_it: Modifica

# Enum 4104196774 - EnumValue 2477294019 - Property 2879900210
source: Delete
it_it: Elimina

# Enum 1422819097 - EnumValue 3133801257 - Property 2879900210
source: Company
it_it: Società

# Enum 3727708842 - EnumValue 368050251 - Property 2879900210
source: Assignee
it_it: Assegna

# Enum 3727708842 - EnumValue 2988554907 - Property 2879900210
source: Assignee (With Validation)
it_it: Assegna (Con validazione)

# Page 3603533785 - Property 2879900210
source: Fields
it_it: Campi

# Page 1462320587 - Action 2851454604 - Property 2879900210
source: Export To Excel
it_it: Esporta in Excel

# Page 1462320587 - Action 3545432896 - Property 2879900210
source: Import From Excel
it_it: Importa da Excel

# Table 3289261557 - Field 3456033531 - Property 2879900210
source: Type
it_it: Tipo

# Table 3289261557 - Field 1195889500 - Method 2126772001 - NamedType 4131985523
source: There is no Table with ID %1
it_it: Non è presente una tabella con ID %1

# Table 3289261557 - Field 1195889500 - Property 2879900210
source: Table No.
it_it: Nr. tabella

# Table 3289261557 - Field 760161316 - Property 2879900210
source: Table Name
it_it: Nome tabella

# Table 3289261557 - Field 2636386265 - Property 2879900210
source: Table Filter
it_it: Filtro tabella

# Table 3289261557 - Field 309010296 - Property 2879900210
source: Source Type
it_it: Tipo origine

# Table 3289261557 - Field 384231925 - Property 2879900210
source: Source No.
it_it: Nr. origine

# Table 3289261557 - Field 2394593088 - Property 2879900210
source: Enabled
it_it: Abilitato

# Table 3289261557 - Field 3210361224 - Property 2879900210
source: Code
it_it: Codice

# Table 3289261557 - Field 949770657 - Property 2879900210
source: Description
it_it: Descrizione

# Table 3289261557 - Property 2879900210
source: Table Mapping (ENV)
it_it: Mapping tabella (ENV)

# Table 887993225 - Field 1195889500 - Property 2879900210
source: Table No.
it_it: Nr. tabella

# Table 887993225 - Field 97974655 - Property 2879900210
source: Replace Type
it_it: Tipo sostituzione

# Table 887993225 - Field 1756253562 - Property 2879900210
source: Replace Value
it_it: Nuovo valore

# Table 887993225 - Field 2785083732 - Property 2879900210
source: Line No.
it_it: Nr. riga

# Table 887993225 - Field 1320056944 - Method 2126772001 - NamedType 4131985523
source: There is no field with ID %1 in table %2.
it_it: Non è presente un campo con ID %1 nella tabella %2

# Table 887993225 - Field 1320056944 - Property 2879900210
source: Field No.
it_it: Nr. campo

# Table 887993225 - Field 2080924904 - Property 2879900210
source: Field Name
it_it: Nome campo

# Table 887993225 - Field 3210361224 - Property 2879900210
source: Code
it_it: Codice

# Table 887993225 - Method 407472073 - NamedType 4204058380
source: Field No. %1 is already used
it_it: Campo nr. %1 già utilizzato

# Table 887993225 - Property 2879900210
source: Field Mapping (ENV)
it_it: Mapping campi (ENV)

# Table 471369648 - Field 972296345 - Property 2879900210
source: Waiting Time Type
it_it: Tipo d'attesa

# Table 471369648 - Field 926283306 - Property 2879900210
source: Waiting Fixed Time (ms)
it_it: Tempo fisso (ms)

# Table 471369648 - Field 1193759973 - Property 2879900210
source: Waiting Time After Attempt (ms)
it_it: Tempo d'attesa a tentativo (ms)

# Table 471369648 - Field 322628400 - Property 2879900210
source: Token Authorization Time
it_it: Data-ora autorizzazione

# Table 471369648 - Field 1686736337 - Property 2879900210
source: Due Date
it_it: Data scadenza

# Table 471369648 - Field 2950639144 - Property 2879900210
source: Production Environment Name
it_it: Nome ambiente produzione

# Table 471369648 - Field 4238666553 - Property 2879900210
source: New Environment Name
it_it: Nome nuovo ambiente

# Table 471369648 - Field 1094314435 - Property 2879900210
source: Max No. Of Attemps
it_it: Nr. massimo di tentativi

# Page 471369648 - Method 1661334556 - NamedType 1327832897
source: No Token
it_it: Nessun token

# Page 471369648 - Method 1661334556 - NamedType 1196336482
source: Token Expired
it_it: Token scaduto

# Page 471369648 - Method 1661334556 - NamedType 1753513791
source: Token Available
it_it: Token disponibile

# Page 471369648 - Control 1735060826 - Property 2879900210
source: Connection
it_it: Connessione

# Page 471369648 - Control 3485336150 - Property 2879900210
source: Token Present
it_it: Token presente

# Page 471369648 - Control 2346885236 - Property 2879900210
source: Options
it_it: Opzioni

# Page 471369648 - Control 2477294019 - Property 2879900210
source: Delete
it_it: Cancellazione

# Page 471369648 - Action 2944148827 - Property 2879900210
source: Delete Job Queue Entry
it_it: Cancella coda processi

# Page 471369648 - Action 1226686359 - Property 2879900210
source: Execute Function
it_it: Esegui funzioni

# Page 471369648 - Action 2792281505 - Property 2879900210
source: Execute Restore
it_it: Esegui ripristino

# Page 471369648 - Action 3001626052 - Property 2879900210
source: Job Queue Entry
it_it: Coda processi

# Page 471369648 - Action 2351941779 - Property 2879900210
source: Open Fields Mapping
it_it: Apri mapping campi

# Page 471369648 - Action 1090334467 - Property 2879900210
source: Try Connection
it_it: Prova connessione

# Page 2722868633 - Property 2879900210
source: Table Mapping (ENV)
it_it: Mapping tabella (ENV)

# Page 2722868633 - NamedType 705097697
source: Show Filters Applied
it_it: Mostra filtri applicati

# Page 2722868633 - Control 2445482498 - Property 2879900210
source: General
it_it: Generale

# Page 2722868633 - Action 4082531897 - Property 2879900210
source: Execute Replace Mapping
it_it: Esegui ripristino mapping

# Page 2722868633 - Action 3477538018 - Property 2879900210
source: Export Excel Structure
it_it: Esporta struttura in Excel

# Page 2722868633 - Action 2851454604 - Property 2879900210
source: Export To Excel
it_it: Exporta in Excel

# Page 2722868633 - Action 3545432896 - Property 2879900210
source: Import From Excel
it_it: Importa da Excel

# Page 2722868633 - Action 2857238821 - Property 2879900210
source: Export To Excel
it_it: Esporta in Excel

# Page 1462320587 - Property 2879900210
source: Table Mapping List (ENV)
it_it: Lista mapping tabella (ENV)

# Page 1462320587 - Action 4082531897 - Property 2879900210
source: Execute Replace Mapping
it_it: Esegui ripristino mapping

# Page 1462320587 - Action 3477538018 - Property 2879900210
source: Export Excel Structure
it_it: Esporta struttura in Excel

# Page 1462320587 - Action 2857238821 - Property 2879900210
source: Export To Excel
it_it: Esporta in Excel

# Table 471369648 - Field 3210361224 - Property 2879900210
source: Code
it_it: Codice

# Table 471369648 - Field 2536478188 - Property 2879900210
source: Connection Is Up
it_it: Connessione attiva

# Page 471369648 - Control 322628400 - Property 2879900210
source: Authorization Time
it_it: Data-ora autorizzazione

# Page 471369648 - Method 2451453410 - NamedType 4204058380
source: This configuration is allowed only in a production environment.
it_it: Questa configurazione è disponibile solo in un ambiente di produzione

# Codeunit 583858742 - Method 2804022923 - NamedType 4204058380
source: Invalid Access Token Property %1, Value: %2
it_it: Proprietà Access Token non valida %1, valore %2

# Codeunit 1773623840 - Method 1147532894 - NamedType 1745287229
source: This action will delete and recreate all lines based on Excel files. Continue?
it_it: Questa azione cancella e ricrea tutte le righe sulla base del file Excel. Continuare?

# Codeunit 1773623840 - Method 13764402 - NamedType 1745287229
source: This action will delete and recreate code %1 based on Excel files. Continue?
it_it: Questa azione cancella e ricrea il codice %1 sulla base del file Excel. Continuare?

# Codeunit 1773623840 - Method 1258532027 - NamedType 1327832897
source: General information for mapping \\1. Codes with "Source Type" field equal to Company will be executed before Database\\2. Codes with "Type" field equal to Delete will be executed before Modify\\3. Export Excel will export all the mapping details, include the non necessary fields (Table Name - Field Name) only for better comprehension\\4. Import Excel will import the mapping details deleting and recreating everythings. The structure must be the same generated from the export action. The unecessary fields (Table Name - Field Name) will not be considered in import functionality. You can leave it blanks but must be in the file.\\5. Executing the "Import From Excel" action from the card will delete only the specific code. From the list will clean every codes.
it_it: Informazioni generali per il mapping \\1. I codici con il "Tipo origine" uguale a Società vengono eseguiti prima di quelli di tipo Database\\2. I codici con "Tipo" elimina vengono eseguiti prima di quelli di tipo modifica.\\3. L'action "Esporta in excel" esporta il dettaglio di tutto il mapping, compreso dei campi non obbligatori (Nome tabella - Nome campo) solo per una migliore comprensione.\\4. L'action "Importa da Excel" importa cancellando e ricreando tutto quanto. La struttura deve essere identica da quella generata dall'action "Esporta in Excel". I campi non obbligatori dovranno essere presenti nel file anche se non verranno processati.\\5. Eseguendo l'action "Importa da Excel" dalla card elimina e ricrea tutto il mapping di solo quel codice. Dalla lista elimina e ricrea tutto quanto

# Codeunit 2794557175 - NamedType 1327832897
source: Operation Completed
it_it: Operazione completata

# Page 173258320 - Property 2879900210
source: Pick
it_it: Seleziona
